{
  "title": "12U ALLEN",
  "staff": [
    {
      "name": "Casey Allen - Head Coach",
      "bio": [
        "Casey is a highly experienced and accomplished softball coach with over 16 years dedicated to athlete development and team leadership. He most recently served as head coach of the Ohio Hit Dogs for two full seasons along with Josh Wheeler, compiling an impressive win total of 79, including 6 tournament championships and 2 runner-up finishes.",
        "Throughout his coaching career, Casey has helped guide numerous athletes to the next level, with several former players going on to compete at the collegiate level. His coaching résumé includes tenures with respected programs such as the Hilliard Express, Pickerington Vipers, Grove City Gators, and Central Ohio Pride. Across his roles as both head coach and assistant coach, Casey’s teams have earned 13 championship titles and 4 runner-up finishes.",
        "Casey is known for fostering a competitive yet supportive team culture, placing a strong emphasis on skill development, effort, and accountability. He believes deeply in the principle that “you get out what you put in,” applying that philosophy to both players and coaches alike."
      ]
    },
    {
      "name": "Josh Wheeler - Assistant Head Coach",
      "bio": [
        "Josh brings a wealth of baseball knowledge and competitive experience to the staff. A former collegiate athlete, Josh played baseball at both Walsh University and Ohio Wesleyan University. Following his collegiate career, Josh served as the head coach for Delaware Hayes Freshman and Junior Varsity baseball programs from 2006-2008, and won the district championship in 2007, an achievement that reflects his dedication to excellence and team success.  Josh also served as Head Coach for the Delaware Cows Summer Program for 4 seasons.",
        "He has coached alongside Casey for the past three seasons, playing an integral role in player development, game strategy, and overall success."
      ]
    }
  ]
}
