{
  "title": "10U BROWN",
  "staff": [
    {
      "name": "Gary Brown - Head Coach",
      "bio": [
        "Gary Brown brings over 20 years of coaching experience and a lifetime of athletic excellence to the softball field. A three-sport standout in baseball, basketball, and football during his amateur career, Gary built a reputation as a competitive and driven athlete. On the baseball diamond, he competed for some of the top teams in Ohio before moving on to play collegiately at St. Petersburg College (a JUCO in Florida), where he earned All-Conference honors twice.",
        "As a coach, Gary has dedicated two decades to developing amateur athletes across multiple sports. He led a competitive travel softball program for 12 seasons, most notably coaching the Firecrackers Ohio 2002 team. Following the travel program’s conclusion, Gary served as Assistant Head Coach at Dublin Coffman High School for six years.",
        "Coach Brown is known for his aggressive, disciplined, and hard-working approach to the game. He emphasizes strong fundamentals, relentless effort, and a love for the game—teaching the sport the right way while fostering a competitive and team-first environment."
      ]
    },
    {
      "name": "Hannah DeLong – Assistant Coach",
      "bio": [
        "A former standout player with the Ohio Hawks and graduate of Mechanicsburg High School, Hannah brings firsthand knowledge of high-level competition and a strong background in player development."
      ]
    },
    {
      "name": "Jenn Sever – Assistant Coach",
      "bio": [
        "Jenn is a seasoned coach with head coaching experience at the 8U and 9U levels. Her leadership and understanding of early athlete development make her an asset to the coaching staff."
      ]
    },
    {
      "name": "Matt Foster – Assistant Coach",
      "bio": [
        "Matt also brings experience as an assistant coach at the 8U and 9U levels, offering a strong foundation in team dynamics and fundamentals."
      ]
    }
  ]
}
