{
  "title": "13U JONES",
  "staff": [
    {
      "name": "Phil Jones - Head Coach",
      "bio": [
        "With 8 years of coaching experience and in his third season leading a travel team, Coach Jones emphasizes mental toughness, softball IQ, and team culture.",
        "His calm, focused leadership fosters personal growth, accountability, and selfless play."
      ]
    },
    {
      "name": "Doug Gray - Associate Head Coach",
      "bio": [
        "Now in his fourth season of travel softball, Coach Gray brings five years of coaching experience, specializing in pitching and defensive strategy.",
        "His structured and technical approach enhances in-game execution and consistency."
      ]
    },
    {
      "name": "Michael Marshack - Assistant Coach",
      "bio": [
        "In his second season with the team, Coach Marshack focuses on individual development and communication, using mentorship and positive reinforcement to support each athlete's growth."
      ]
    },
    {
      "name": "Chad Howard - Assistant Coach",
      "bio": [
        "Also entering year two with the team, Coach Howard leads instruction in baserunning and catching, emphasizing efficiency, effort, and situational awareness."
      ]
    },
    {
      "name": "Kyle Rhoad - Assistant Coach",
      "bio": [
        "A former Division I player at Eastern Michigan and minor leaguer with the Texas Rangers, Coach Rhoad brings elite-level insight.",
        "He focuses on hitting, baserunning, and outfield play, drawing from four years of coaching experience and a professional playing background."
      ]
    },
    {
      "name": "Dani Ramos - Assistant Coach",
      "bio": [
        "A former First Team All-MAC standout at Kent State University, Coach Ramos brings over six years of coaching experience.",
        "As a certified hitting instructor and former head coach at Worthington Christian and the Ohio All-Americans, she combines high-level playing experience with a proven ability to build confidence and elevate performance at the plate."
      ]
    }
  ]
}
